Repository: dungngminh/very_good_flutter_blog_app
Catalog: mobile/lib/l10n/arb/app_*.arb
Languages: vi

source: Username
vi: Tên người dùng

# usernameHint
source: Input your username
vi: Nhập vào tên người dùng

source: Password
vi: Mật khẩu

# passwordHint
source: Input your password
vi: Nhập vào mật khẩu

source: Forgot password
vi: Quên mật khẩu

source: Login
vi: Đăng nhập

source: Firstname
vi: Họ của bạn

# firstNameHint
source: Input your firstname
vi: Nhập vào họ của bạn

source: Lastname
vi: Tên của bạn

# lastNameHint
source: Input your lastname
vi: Nhập vào tên của bạn

source: Confirmation Password
vi: Xác nhân mật khẩu

# unmatchedPassword
source: Password do not match
vi: Mật khẩu không trùng

# passwordLength
source: Password must be at least 8 characters
vi: Mật khẩu phải có ít nhất 8 ký tự

# usernameEmpty
source: Username cannot be empty
vi: Tên người dùng không được để trống

# passwordEmpty
source: Password cannot be empty
vi: Mật khẩu không được để trống

# firstNameEmpty
source: Firstname cannot be empty
vi: Họ của bạn không được để trống

# lastNameEmpty
source: Lastname cannot be empty
vi: Tên của bạn không được để trống

# confirmationPasswordHint
source: Input your password again
vi: Nhập lại mật khẩu

# notHaveAccountYet
source: Don't have an account yet?
vi: Chưa có tài khoản?

source: Register
vi: Đăng ký

# duplicateUser
source: Username already exists!
vi: Tên người dùng đã tồn tại

source: Register successfully!
vi: Đăng ký thành công

source: Register failed!
vi: Đăng ký thất bại

# helloUser
source: Hi, {name}
vi: Xin chào, {name}

# category
source: {category, select, all{All} life{Life} science{Science} travel{Travel} food{Food} other{Category}}
vi: {category, select, all{Tất cả} life{Đời sống} science{Khoa học} travel{Du lịch} food{Ẩm thực} other{Thể loại}}

source: Popular
vi: Phổ biến

source: All blogs
vi: Tất cả bài viết

# noBlogs
source: No blogs here
vi: Không có bài viết nào

source: Welcome!
vi: Chào mừng bạn!

source: Notification
vi: Thông báo

# followYou
source: Followed you
vi: Đã theo dõi bạn

# savedBlogList
source: Saved blog
vi: Danh sách bài viêt đã lưu

# noSavedBlogs
source: You have not saved any blogs
vi: Bạn không có bài viết nào đã lưu

# noNotification
source: You have no notification
vi: Bạn không có thông báo nào

# noLikedBlogs
source: You have not liked any blogs
vi: Bạn chưa thích bài viết nào

# noOwnBlogs
source: You have not created any blogs
vi: Bạn chưa có bài viết nào

source: Blog
vi: Bài viết

source: Follower
vi: Người t.dõi

source: Following
vi: Đang t.dõi

source: User information
vi: Thông tin cá nhân

source: Option
vi: Tùy chọn

source: About Very Good Blog App
vi: Về Very Good Blog App

source: Log out
vi: Đăng xuất

source: Draft
vi: Nháp

# nextAction
source: Continue
vi: Tiếp tục

source: Upload blog
vi: Đăng bài viết

source: Update blog
vi: Cập nhật bài viết

# titleBlog
source: Title
vi: Tiêu đề

# titleBlogFieldHint
source: Input your blog title
vi: Nhập vào tiêu đề blog của bạn

source: Add picture
vi: Thêm ảnh

source: Choose category
vi: Chọn thể loại

source: Create blog successfully!
vi: Đăng bài viết thành công

source: Create blog failed!
vi: Đăng bài viết thất bại

source: Update blog successfully!
vi: Cập nhật bài viết thành công

source: Update blog failed!
vi: Cập nhật bài viết thất bại

# updateUserInfromationSuccessfully
source: Update user information successfully!
vi: Cập nhật người dùng thành công

# updateUserInfromationFailed
source: Update user information failed!
vi: Cập nhật người dùng thất bại

# pendingUpdateUserInfromation
source: Pending update user information!
vi: Đang cập nhật thông tin người dùng

# previewTooltip
source: You can preview your blog before uploading
vi: Bạn có thể xem trước bài viết trước khi đăng

source: Cancel
vi: Hủy

# confirmToLoggout
source: Confirm to log out Very Good Blog App
vi: Xác nhận đăng xuất Very Good Blog App

# currentOfflineMode
source: You are currently in offline mode
vi: Hiện tại bạn đang ở chế độ ngoại tuyến

# blogsOfCategory
source: Blogs about {category, select, life{Life} science{Science} travel{Travel} food{Food} other{All}}
vi: Bài viết {category, select, life{Đời sống} science{Khoa học} travel{Du lịch} food{Ẩm thực} other{Tất cả}}

# resultSearch
source: Search result
vi: Kết quả tìm kiếm

# searchHint
source: Search
vi: Tìm kiếm

# removedFromSavedList
source: Removed from saved blogs
vi: Đã xóa khỏi dạnh sách đã lưu

# addedToSavedList
source: Added to saved blogs
vi: Đã thêm vào dạnh sách đã lưu

# fetchingFailedPlsTryAgain
source: Fetching failed, please try again!
vi: Cập nhật thất bại, hãy thử lại!

source: User
vi: bạn

# titleBlogEmpty
source: Title of blog cannot be empty
vi: Tiêu đề bài viết không được để trống

# unknownError
source: Something went wrong, please try again!
vi: Đã có lỗi xảy ra, vui lòng thử lại

source: All
vi: Tất cả

source: Liked
vi: Đã thích
